//========================================
//
// ウォール[wall.cpp]
// Author：森川駿弥
//
//========================================
#include "wall.h"
#include "manager.h"
#include "renderer.h"
#include "texture.h"

//========================================
//静的メンバ変数
//========================================
LPDIRECT3DTEXTURE9 CWall::m_pTexture = nullptr;

//========================================
//コンストラクタ
//========================================
CWall::CWall(int nPriority) :
	CObject3D(nPriority)
{
}

//========================================
//デストラクタ
//========================================
CWall::~CWall()
{
}

//========================================
//ポリゴン生成
//========================================
CWall* CWall::Create(void)
{
	//CPlayer型のポインタ
	CWall* pWall = new CWall;

	//初期化
	pWall->Init();

	//ポインタを返す
	return pWall;
}

//========================================
//初期化
//========================================
HRESULT CWall::Init(void)
{
	//テクスチャのポインタ
	CTexture* pTexture = CManager::GetInstance()->GetTexture();

	// 継承の初期化
	CObject3D::Init();

	//テクスチャ割り当て
	BindTexture(pTexture->Regist("data\\texture\\soil.jpg"));

	return S_OK;
}

//========================================
//終了
//========================================
void CWall::Uninit(void)
{
}

//========================================
//更新
//========================================
void CWall::Update(void)
{
}

//========================================
//描画
//========================================
void CWall::Draw(void)
{
	//描画
	CObject3D::Draw();
}
